"use client";

import style from './navMenu.module.css';
import {useSelectedLayoutSegment} from "next/navigation";
import Link from "next/link";
import {useRecoilState, useRecoilValue} from "recoil";
import {Member, unreadMessageCount} from "@/app/_component/MemberRecoilState";
import {useEffect, useState} from "react";



export default function NavMenu() {
    const segment = useSelectedLayoutSegment()?.replace('%40','@');

    const me = useRecoilValue(Member);
    const unread = useRecoilValue(unreadMessageCount);


    const [isClient, setIsClient] = useState(false);

    useEffect(() => {
        if (typeof window !== 'undefined') {
        setIsClient(true)
            }
    }, []);

    if (isClient){
    return (
        <>
            <li>
                <Link href="/home">
                    <div className={style.navPill}>
                        {segment === 'home' ?
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M12 1.696L.622 8.807l1.06 1.696L3 9.679V19.5C3 20.881 4.119 22 5.5 22h13c1.381 0 2.5-1.119 2.5-2.5V9.679l1.318.824 1.06-1.696L12 1.696zM12 16.5c-1.933 0-3.5-1.567-3.5-3.5s1.567-3.5 3.5-3.5 3.5 1.567 3.5 3.5-1.567 3.5-3.5 3.5z"></path>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>홈</div>
                            </> :
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M12 9c-2.209 0-4 1.791-4 4s1.791 4 4 4 4-1.791 4-4-1.791-4-4-4zm0 6c-1.105 0-2-.895-2-2s.895-2 2-2 2 .895 2 2-.895 2-2 2zm0-13.304L.622 8.807l1.06 1.696L3 9.679V19.5C3 20.881 4.119 22 5.5 22h13c1.381 0 2.5-1.119 2.5-2.5V9.679l1.318.824 1.06-1.696L12 1.696zM19 19.5c0 .276-.224.5-.5.5h-13c-.276 0-.5-.224-.5-.5V8.429l7-4.375 7 4.375V19.5z"></path>
                                    </g>
                                </svg>
                                <div>홈</div>
                            </>}
                    </div>
                </Link>
            </li>
            <li>
                <Link href="/myAMAD">
                    <div className={style.navPill}>
                        {segment === 'myAMAD' ?
                            <>
                                <svg width={28} viewBox="1 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M6 22h15v-2H6.012C5.55 19.988 5 19.805 5 19s.55-.988 1.012-1H21V4a2 2 0 0 0-2-2H6c-1.206 0-3 .799-3 3v14c0 2.201 1.794 3 3 3zM8 7h3V5h2v2h3v2h-3v6h-2V9H8V7z"/>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>My AMAD</div>
                            </> :
                            <>
                                <svg width={28} viewBox="1 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M6 22h15v-2H6.012C5.55 19.988 5 19.805 5 19s.55-.988 1.012-1H21V4c0-1.103-.897-2-2-2H6c-1.206 0-3 .799-3 3v14c0 2.201 1.794 3 3 3zM5 8V5c0-.805.55-.988 1-1h13v12H5V8z"/>
                                        <path d="M11 14h2v-4h2V8h-2V6h-2v2H9v2h2z"/>
                                    </g>
                                </svg>
                                <div>My AMAD</div>
                            </>}
                    </div>
                </Link>
            </li>
            <li>
                <Link href="/groups">
                    <div className={style.navPill}>
                        {segment === 'groups' ?
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                                    <g>
                                        <path d="M12 12.75c1.63 0 3.07.39 4.24.9 1.08.48 1.76 1.56 1.76 2.73V18H6v-1.61c0-1.18.68-2.26 1.76-2.73 1.17-.52 2.61-.91 4.24-.91zM4 13c1.1 0 2-.9 2-2s-.9-2-2-2-2 .9-2 2 .9 2 2 2zm1.13 1.1c-.37-.06-.74-.1-1.13-.1-.99 0-1.93.21-2.78.58C.48 14.9 0 15.62 0 16.43V18h4.5v-1.61c0-.83.23-1.61.63-2.29zM20 13c1.1 0 2-.9 2-2s-.9-2-2-2-2 .9-2 2 .9 2 2 2zm4 3.43c0-.81-.48-1.53-1.22-1.85-.85-.37-1.79-.58-2.78-.58-.39 0-.76.04-1.13.1.4.68.63 1.46.63 2.29V18H24v-1.57zM12 6c1.66 0 3 1.34 3 3s-1.34 3-3 3-3-1.34-3-3 1.34-3 3-3z"/>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>그룹</div>
                            </> :
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                                    <g>
                                        <path d="M16.5 13c-1.2 0-3.07.34-4.5 1-1.43-.67-3.3-1-4.5-1C5.33 13 1 14.08 1 16.25V19h22v-2.75c0-2.17-4.33-3.25-6.5-3.25zm-4 4.5h-10v-1.25c0-.54 2.56-1.75 5-1.75s5 1.21 5 1.75v1.25zm9 0H14v-1.25c0-.46-.2-.86-.52-1.22.88-.3 1.96-.53 3.02-.53 2.44 0 5 1.21 5 1.75v1.25zM7.5 12c1.93 0 3.5-1.57 3.5-3.5S9.43 5 7.5 5 4 6.57 4 8.5 5.57 12 7.5 12zm0-5.5c1.1 0 2 .9 2 2s-.9 2-2 2-2-.9-2-2 .9-2 2-2zm9 5.5c1.93 0 3.5-1.57 3.5-3.5S18.43 5 16.5 5 13 6.57 13 8.5s1.57 3.5 3.5 3.5zm0-5.5c1.1 0 2 .9 2 2s-.9 2-2 2-2-.9-2-2 .9-2 2-2z"/>
                                    </g>
                                </svg>
                                <div>그룹</div>
                            </>}
                    </div>
                </Link>
            </li>
            <li>
                <Link href="/explore">
                    <div className={style.navPill}>
                        {segment && (['search', 'explore'].includes(segment)) ?
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M10.25 4.25c-3.314 0-6 2.686-6 6s2.686 6 6 6c1.657 0 3.155-.67 4.243-1.757 1.087-1.088 1.757-2.586 1.757-4.243 0-3.314-2.686-6-6-6zm-9 6c0-4.971 4.029-9 9-9s9 4.029 9 9c0 1.943-.617 3.744-1.664 5.215l4.475 4.474-2.122 2.122-4.474-4.475c-1.471 1.047-3.272 1.664-5.215 1.664-4.971 0-9-4.029-9-9z"></path>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>탐색하기</div>
                            </> :
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M10.25 3.75c-3.59 0-6.5 2.91-6.5 6.5s2.91 6.5 6.5 6.5c1.795 0 3.419-.726 4.596-1.904 1.178-1.177 1.904-2.801 1.904-4.596 0-3.59-2.91-6.5-6.5-6.5zm-8.5 6.5c0-4.694 3.806-8.5 8.5-8.5s8.5 3.806 8.5 8.5c0 1.986-.682 3.815-1.824 5.262l4.781 4.781-1.414 1.414-4.781-4.781c-1.447 1.142-3.276 1.824-5.262 1.824-4.694 0-8.5-3.806-8.5-8.5z"></path>
                                    </g>
                                </svg>
                                <div>탐색하기</div>
                            </>
                        }
                    </div>
                </Link>
            </li>
            <li>
                <Link href="/messages">
                    <div className={style.navPill}>
                        {segment === 'messages' ?
                            <>
                                <span className={style.iconWrapper}>
                                    <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                         className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                        <g>
                                            <path
                                                d="M1.998 4.499c0-.828.671-1.499 1.5-1.499h17c.828 0 1.5.671 1.5 1.499v2.858l-10 4.545-10-4.547V4.499zm0 5.053V19.5c0 .828.671 1.5 1.5 1.5h17c.828 0 1.5-.672 1.5-1.5V9.554l-10 4.545-10-4.547z"></path>
                                        </g>
                                    </svg>
                                    {unread > 0 && <span className={style.badge}>{unread > 99 ? '99+' : unread}</span>}
                                </span>
                                <div style={{fontWeight: 'bold'}}>쪽지</div>
                            </> :
                            <>
                                <span className={style.iconWrapper}>
                                    <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                         className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                        <g>
                                            <path
                                                d="M1.998 5.5c0-1.381 1.119-2.5 2.5-2.5h15c1.381 0 2.5 1.119 2.5 2.5v13c0 1.381-1.119 2.5-2.5 2.5h-15c-1.381 0-2.5-1.119-2.5-2.5v-13zm2.5-.5c-.276 0-.5.224-.5.5v2.764l8 3.638 8-3.636V5.5c0-.276-.224-.5-.5-.5h-15zm15.5 5.463l-8 3.636-8-3.638V18.5c0 .276.224.5.5.5h15c.276 0 .5-.224.5-.5v-8.037z"></path>
                                        </g>
                                    </svg>
                                    {unread > 0 && <span className={style.badge}>{unread > 99 ? '99+' : unread}</span>}
                                </span>
                                <div>쪽지</div>
                            </>}
                    </div>
                </Link>
            </li>
            {!me?.email && <li>
                <Link href="/i/flow/login">
                    <div className={style.navPill}>
                        <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                            <g>
                                <path d="M12 2C9.791 2 8 3.79 8 6s1.791 4 4 4 4-1.79 4-4-1.791-4-4-4zm0 6c-1.105 0-2-.895-2-2s.895-2 2-2 2 .895 2 2-.895 2-2 2zm5.863 5.44C16.373 11.85 14.352 11 12 11s-4.373.85-5.863 2.44C4.677 15.02 3.788 17.24 3.522 19.9l-.11 1.1h17.176l-.11-1.1c-.266-2.66-1.155-4.88-2.615-6.46z"/>
                            </g>
                        </svg>
                        <div>로그인</div>
                    </div>
                </Link>
            </li>}
            {me?.email && <li>
                <Link href={`/${me?.email}`}>
                    <div className={style.navPill}>
                        {segment === me.email ? <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M17.863 13.44c1.477 1.58 2.366 3.8 2.632 6.46l.11 1.1H3.395l.11-1.1c.266-2.66 1.155-4.88 2.632-6.46C7.627 11.85 9.648 11 12 11s4.373.85 5.863 2.44zM12 2C9.791 2 8 3.79 8 6s1.791 4 4 4 4-1.79 4-4-1.791-4-4-4z"></path>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>프로필</div>
                            </> :
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true"
                                     className="r-18jsvk2 r-4qtqp9 r-yyyyoo r-lwhw9o r-dnmrzs r-bnwqim r-1plcrui r-lrvibr r-cnnz9e">
                                    <g>
                                        <path
                                            d="M5.651 19h12.698c-.337-1.8-1.023-3.21-1.945-4.19C15.318 13.65 13.838 13 12 13s-3.317.65-4.404 1.81c-.922.98-1.608 2.39-1.945 4.19zm.486-5.56C7.627 11.85 9.648 11 12 11s4.373.85 5.863 2.44c1.477 1.58 2.366 3.8 2.632 6.46l.11 1.1H3.395l.11-1.1c.266-2.66 1.155-4.88 2.632-6.46zM12 4c-1.105 0-2 .9-2 2s.895 2 2 2 2-.9 2-2-.895-2-2-2zM8 6c0-2.21 1.791-4 4-4s4 1.79 4 4-1.791 4-4 4-4-1.79-4-4z"></path>
                                    </g>
                                </svg>
                                <div>프로필</div>
                            </>}
                    </div>
                </Link>
            </li>}
            <li>
                <Link href="/pricing">
                    <div className={style.navPill}>
                        {segment === 'pricing' ?
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                                    <g>
                                        <path d="M12 2l2.582 6.953L22 9.257l-5.5 5.168L18.18 22 12 18.38 5.82 22l1.68-7.575L2 9.257l7.418-.304z"/>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>구독</div>
                            </> :
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                                    <g>
                                        <path d="M12 2l2.582 6.953L22 9.257l-5.5 5.168L18.18 22 12 18.38 5.82 22l1.68-7.575L2 9.257l7.418-.304zM12 4.797L10.065 10.1l-5.511.226 4.232 3.98-1.237 5.596L12 16.872l4.451 3.03-1.237-5.596 4.232-3.98-5.511-.226z"/>
                                    </g>
                                </svg>
                                <div>구독</div>
                            </>}
                    </div>
                </Link>
            </li>
            <li>
                <Link href="/aboutAmad">
                    <div className={style.navPill}>
                        {segment === 'aboutAmad' ?
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                                    <g>
                                        <path d="M12 2C6.48 2 2 6.48 2 12s4.48 10 10 10 10-4.48 10-10S17.52 2 12 2zm1 15h-2v-6h2v6zm0-8h-2V7h2v2z"/>
                                    </g>
                                </svg>
                                <div style={{fontWeight: 'bold'}}>AMAD 안내</div>
                            </> :
                            <>
                                <svg width={26} viewBox="0 0 24 24" aria-hidden="true">
                                    <g>
                                        <path d="M12 2C6.48 2 2 6.48 2 12s4.48 10 10 10 10-4.48 10-10S17.52 2 12 2zm1 15h-2v-6h2v6zm0-8h-2V7h2v2z"/>
                                    </g>
                                </svg>
                                <div>AMAD 안내</div>
                            </>}
                    </div>
                </Link>
            </li>
            {me?.roles[0] === 'ADMIN' && <li>
                <Link href={`/admin`}>
                    <div className={style.navPill}>
                        {segment === 'admin' ? <>
                        <svg xmlns="http://www.w3.org/2000/svg" width="28px" height="28px" viewBox="0 0 24 24" fill="none">
                        <path fillRule="evenodd" clipRule="evenodd" d="M12.7848 0.449982C13.8239 0.449982 14.7167 1.16546 14.9122 2.15495L14.9991 2.59495C15.3408 4.32442 17.1859 5.35722 18.9016 4.7794L19.3383 4.63233C20.3199 4.30175 21.4054 4.69358 21.9249 5.56605L22.7097 6.88386C23.2293 7.75636 23.0365 8.86366 22.2504 9.52253L21.9008 9.81555C20.5267 10.9672 20.5267 13.0328 21.9008 14.1844L22.2504 14.4774C23.0365 15.1363 23.2293 16.2436 22.7097 17.1161L21.925 18.4339C21.4054 19.3064 20.3199 19.6982 19.3382 19.3676L18.9017 19.2205C17.1859 18.6426 15.3408 19.6754 14.9991 21.405L14.9122 21.845C14.7167 22.8345 13.8239 23.55 12.7848 23.55H11.2152C10.1761 23.55 9.28331 22.8345 9.08781 21.8451L9.00082 21.4048C8.65909 19.6754 6.81395 18.6426 5.09822 19.2205L4.66179 19.3675C3.68016 19.6982 2.59465 19.3063 2.07505 18.4338L1.2903 17.1161C0.770719 16.2436 0.963446 15.1363 1.74956 14.4774L2.09922 14.1844C3.47324 13.0327 3.47324 10.9672 2.09922 9.8156L1.74956 9.52254C0.963446 8.86366 0.77072 7.75638 1.2903 6.8839L2.07508 5.56608C2.59466 4.69359 3.68014 4.30176 4.66176 4.63236L5.09831 4.77939C6.81401 5.35722 8.65909 4.32449 9.00082 2.59506L9.0878 2.15487C9.28331 1.16542 10.176 0.449982 11.2152 0.449982H12.7848ZM12 15.3C13.8225 15.3 15.3 13.8225 15.3 12C15.3 10.1774 13.8225 8.69998 12 8.69998C10.1774 8.69998 8.69997 10.1774 8.69997 12C8.69997 13.8225 10.1774 15.3 12 15.3Z" fill="#000000"/>
                        </svg>
                                <div style={{fontWeight: 'bold'}}>어드민</div>
                            </> :
                            <>
                               <svg xmlns="http://www.w3.org/2000/svg" width="28px" height="28px" viewBox="0 0 24 24" fill="none">
                        <path fillRule="evenodd" clipRule="evenodd" d="M12.0002 8C9.79111 8 8.00024 9.79086 8.00024 12C8.00024 14.2091 9.79111 16 12.0002 16C14.2094 16 16.0002 14.2091 16.0002 12C16.0002 9.79086 14.2094 8 12.0002 8ZM10.0002 12C10.0002 10.8954 10.8957 10 12.0002 10C13.1048 10 14.0002 10.8954 14.0002 12C14.0002 13.1046 13.1048 14 12.0002 14C10.8957 14 10.0002 13.1046 10.0002 12Z" fill="#000000"/>
                        <path fillRule="evenodd" clipRule="evenodd" d="M11.2867 0.5C9.88583 0.5 8.6461 1.46745 8.37171 2.85605L8.29264 3.25622C8.10489 4.20638 7.06195 4.83059 6.04511 4.48813L5.64825 4.35447C4.32246 3.90796 2.83873 4.42968 2.11836 5.63933L1.40492 6.83735C0.67773 8.05846 0.954349 9.60487 2.03927 10.5142L2.35714 10.7806C3.12939 11.4279 3.12939 12.5721 2.35714 13.2194L2.03927 13.4858C0.954349 14.3951 0.67773 15.9415 1.40492 17.1626L2.11833 18.3606C2.83872 19.5703 4.3225 20.092 5.64831 19.6455L6.04506 19.5118C7.06191 19.1693 8.1049 19.7935 8.29264 20.7437L8.37172 21.1439C8.6461 22.5325 9.88584 23.5 11.2867 23.5H12.7136C14.1146 23.5 15.3543 22.5325 15.6287 21.1438L15.7077 20.7438C15.8954 19.7936 16.9384 19.1693 17.9553 19.5118L18.3521 19.6455C19.6779 20.092 21.1617 19.5703 21.8821 18.3606L22.5955 17.1627C23.3227 15.9416 23.046 14.3951 21.9611 13.4858L21.6432 13.2194C20.8709 12.5722 20.8709 11.4278 21.6432 10.7806L21.9611 10.5142C23.046 9.60489 23.3227 8.05845 22.5955 6.83732L21.8821 5.63932C21.1617 4.42968 19.678 3.90795 18.3522 4.35444L17.9552 4.48814C16.9384 4.83059 15.8954 4.20634 15.7077 3.25617L15.6287 2.85616C15.3543 1.46751 14.1146 0.5 12.7136 0.5H11.2867ZM10.3338 3.24375C10.4149 2.83334 10.7983 2.5 11.2867 2.5H12.7136C13.2021 2.5 13.5855 2.83336 13.6666 3.24378L13.7456 3.64379C14.1791 5.83811 16.4909 7.09167 18.5935 6.38353L18.9905 6.24984C19.4495 6.09527 19.9394 6.28595 20.1637 6.66264L20.8771 7.86064C21.0946 8.22587 21.0208 8.69271 20.6764 8.98135L20.3586 9.24773C18.6325 10.6943 18.6325 13.3057 20.3586 14.7523L20.6764 15.0186C21.0208 15.3073 21.0946 15.7741 20.8771 16.1394L20.1637 17.3373C19.9394 17.714 19.4495 17.9047 18.9905 17.7501L18.5936 17.6164C16.4909 16.9082 14.1791 18.1618 13.7456 20.3562L13.6666 20.7562C13.5855 21.1666 13.2021 21.5 12.7136 21.5H11.2867C10.7983 21.5 10.4149 21.1667 10.3338 20.7562L10.2547 20.356C9.82113 18.1617 7.50931 16.9082 5.40665 17.6165L5.0099 17.7501C4.55092 17.9047 4.06104 17.714 3.83671 17.3373L3.1233 16.1393C2.9058 15.7741 2.97959 15.3073 3.32398 15.0186L3.64185 14.7522C5.36782 13.3056 5.36781 10.6944 3.64185 9.24779L3.32398 8.98137C2.97959 8.69273 2.9058 8.2259 3.1233 7.86067L3.83674 6.66266C4.06106 6.28596 4.55093 6.09528 5.0099 6.24986L5.40676 6.38352C7.50938 7.09166 9.82112 5.83819 10.2547 3.64392L10.3338 3.24375Z" fill="#000000"/>
                        </svg>
                                <div>어드민</div>
                            </>}
                    </div>
                </Link>
            </li>}
        </>
    );}

}